app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activation_digest" = ? LIMIT 1  [["activation_digest", "ONEht4xZ5tJjx2AXUHxffw"]]
---
    def edit
        user = User.find_by_activation_digest(params[:id])