app/controllers/logins_controller.rb

  def create
    @user = User.new(user_params)
    @user.encrypt_password
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "salt", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?)

  def confirm_email
    user = User.find_by_activation_digest(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."activation_digest" = ? LIMIT 1  [["activation_digest", "$2a$10$cC6P/VGCle4IlePCO/kMxeui6pcr4NrldIP/kdj8ON0K5qXYLXSHu"]]