app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    @submissions = Submission.all

INSERT INTO "submissions" ("category", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "asdf"], ["title", "asdf"], ["content", "asdf"], ["user_id", "asdf"], ["created_at", "2018-06-22 15:26:45.965862"], ["updated_at", "2018-06-22 15:26:45.965862"]]
---
  def create
    @submission = Submission.new(submission_params)
    if @submission.save

DELETE FROM "submissions" WHERE "submissions"."id" = ?  [["id", 10]]
---
  def destroy
    @submission.destroy

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_submission
      @submission = Submission.find(params[:id])